/* 2254298 信11 范潇 */
#include <iostream>
#include <iomanip>
#include <Windows.h>
using namespace std;
	long long sum=0;
/***************************************************************************
  函数名称：
  功    能：返回fibonacci数列的第n项的值
  输入参数：
  返 回 值：
  说    明：不允许任何形式的循环出现
***************************************************************************/
int fibonacci(int n)
{
	if (n == 1 || n == 2) {
		sum++;
		return 1;
	}
	sum++;
	return(fibonacci(n - 2) + fibonacci(n - 1));
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不允许修改
***************************************************************************/
int main()
{
	int i;
	for (i=3; i <= 46; i++) {
		sum = 0;
		fibonacci(i);
		cout <<"n="<<setw(2)<<i<<"时,递归次数为" << sum << endl;
	}
	return 0;
}